In [3]:
import numpy as np
import pandas as pd

In [7]:
from numpy.random import randn
np.random.seed(50)
randn(5,5)

array([[-1.56035211, -0.0309776 , -0.62092842, -1.46458049,  1.41194612],
       [-0.47673214, -0.78046921,  1.07026774, -1.2822926 , -1.3274789 ],
       [ 0.12633764,  0.86219372,  0.69673696, -0.33456518, -0.99752606],
       [ 1.59890829,  3.31407535,  0.98777046,  0.12386626,  0.74278539],
       [-0.39395585,  0.14811582, -0.41223445, -0.16071506,  0.13953147]])

In [15]:
value=np.random.seed(20)

In [21]:
randn(4,4)

array([[ 0.52706972, -1.55110074,  0.32961334, -1.13652654],
       [-0.3384906 ,  0.32097078, -0.60230802,  1.54472836],
       [ 0.64703408,  0.59321721,  0.4380245 ,  1.35778902],
       [ 1.20451128,  1.35179619,  0.49343724, -2.70436525]])

DATA FRAME CREATION

In [9]:
df=pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='@ # $ % ^'.split())
df

          @         #         $         %         ^
A  0.285469 -0.281262  1.710907 -0.149767  0.690307
B  1.095210  1.338409 -1.368982  0.486428  0.753522
C  0.363465 -0.314710  1.373281 -0.624417  0.375754
D -0.200416  0.743038  0.857362 -1.506189 -1.666352
E -0.218995 -0.358858  0.378528  0.684215 -1.167856

In [224]:
df['@']

A    0.211593
B    0.533533
C   -0.875581
D    0.363703
E   -0.897837
Name: @, dtype: float64

In [226]:
df['@':]

          @         #         $         %         ^
A  0.211593 -0.649301  1.199065  0.437168 -0.688731
B  0.533533  0.292956 -0.072711 -0.013516 -1.457686
C -0.875581  0.367696 -0.494104 -0.108670  1.920631
D  0.363703 -1.015418  0.201318  1.257544 -0.671363
E -0.897837  0.337236  0.237636 -1.045383 -0.952159

In [228]:
df.loc['A']

@    0.211593
#   -0.649301
$    1.199065
%    0.437168
^   -0.688731
Name: A, dtype: float64

In [230]:
df.loc['A','@']

0.21159254186563414

In [232]:
df.iloc[2]

@   -0.875581
#    0.367696
$   -0.494104
%   -0.108670
^    1.920631
Name: C, dtype: float64

In [234]:
df.drop('@',axis=1)
#this function remove'#'cloum

          #         $         %         ^
A -0.649301  1.199065  0.437168 -0.688731
B  0.292956 -0.072711 -0.013516 -1.457686
C  0.367696 -0.494104 -0.108670  1.920631
D -1.015418  0.201318  1.257544 -0.671363
E  0.337236  0.237636 -1.045383 -0.952159

In [250]:
df
#but not remove

          #         $         %         ^       new
A -0.649301  1.199065  0.437168 -0.688731  0.549764
B  0.292956 -0.072711 -0.013516 -1.457686  0.220245
C  0.367696 -0.494104 -0.108670  1.920631 -0.126408
D -1.015418  0.201318  1.257544 -0.671363 -0.814100

In [238]:
df.drop('@',axis=1,inplace=True)
df

          #         $         %         ^
A -0.649301  1.199065  0.437168 -0.688731
B  0.292956 -0.072711 -0.013516 -1.457686
C  0.367696 -0.494104 -0.108670  1.920631
D -1.015418  0.201318  1.257544 -0.671363
E  0.337236  0.237636 -1.045383 -0.952159

In [240]:
df.drop('E',axis=0,inplace=True)
df

          #         $         %         ^
A -0.649301  1.199065  0.437168 -0.688731
B  0.292956 -0.072711 -0.013516 -1.457686
C  0.367696 -0.494104 -0.108670  1.920631
D -1.015418  0.201318  1.257544 -0.671363

In [242]:
df['new']=df['$']+df['#']

In [244]:
df

          #         $         %         ^       new
A -0.649301  1.199065  0.437168 -0.688731  0.549764
B  0.292956 -0.072711 -0.013516 -1.457686  0.220245
C  0.367696 -0.494104 -0.108670  1.920631 -0.126408
D -1.015418  0.201318  1.257544 -0.671363 -0.814100

## apply condition

In [260]:
df

          @         #         $         %         ^
A -0.804961 -0.282603  0.031441 -1.154067  0.087961
B -0.106644 -0.262541  0.139950 -1.538722  1.297108
C  0.738118  1.443248  0.046959 -0.445737  0.631887
D -1.425992 -0.215432 -0.590315  1.905088  0.952670
E -0.432973 -0.730569 -1.093725  0.437599 -0.761883

In [264]:
df>0

       @      #      $      %      ^
A  False  False   True  False   True
B  False  False   True  False   True
C   True   True   True  False   True
D  False  False  False   True   True
E  False  False  False   True  False

In [266]:
df[df>0]

          @         #         $         %         ^
A       NaN       NaN  0.031441       NaN  0.087961
B       NaN       NaN  0.139950       NaN  1.297108
C  0.738118  1.443248  0.046959       NaN  0.631887
D       NaN       NaN       NaN  1.905088  0.952670
E       NaN       NaN       NaN  0.437599       NaN

In [269]:
df['@']>0

A    False
B    False
C     True
D    False
E    False
Name: @, dtype: bool

In [273]:
df[df['@']>0]

          @         #         $         %         ^
C  0.738118  1.443248  0.046959 -0.445737  0.631887

In [275]:
df[df['$']>0]

          @         #         $         %         ^
A -0.804961 -0.282603  0.031441 -1.154067  0.087961
B -0.106644 -0.262541  0.139950 -1.538722  1.297108
C  0.738118  1.443248  0.046959 -0.445737  0.631887

In [285]:
df[(df['$']>0)|(df['#']>0)]

          @         #         $         %         ^
A -0.804961 -0.282603  0.031441 -1.154067  0.087961
B -0.106644 -0.262541  0.139950 -1.538722  1.297108
C  0.738118  1.443248  0.046959 -0.445737  0.631887

In [287]:
 df[(df['$']>0)&(df['#']>0)]

          @         #         $         %         ^
C  0.738118  1.443248  0.046959 -0.445737  0.631887

In [13]:
df[df['%']>0][['@','$']]

          @         $
B  1.095210 -1.368982
E -0.218995  0.378528

## multi index

In [20]:
out_number = ['G1','G1','G1','G2','G2','G2']
in_number= [1,2,3,1,2,3]
a = list(zip(out_number,in_number))
a= pd.MultiIndex.from_tuples(a)

In [22]:
a

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [30]:
out_number = ['G1','G1','G1','G2','G2','G2']
in_number= [1,2,3,1,2,3]
b= list(zip(out_number,in_number))
b= pd.MultiIndex.from_tuples(a)

In [32]:
b

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [65]:
fd=pd.DataFrame(np.random.randn(6,4),index=b,columns=['$','@','#','*'])
fd

             $         @         #         *
G1 1 -1.083450 -0.620927  0.295631 -0.125035
   2  0.482244  0.845536  1.147897  0.299140
   3  1.098071  0.053107 -0.830484  0.574053
G2 1  0.820138  1.279440 -2.007495 -0.725142
   2 -1.169742  0.814842 -1.159823 -1.601048
   3  0.149229  1.884882  1.031405 -1.787932

In [45]:
df = pd.DataFrame(np.random.randn(6,2),index=a,columns=['A','B'])
df

             A         B
G1 1  0.870415  0.748973
   2  0.709533  0.316149
   3 -0.778214 -0.535962
G2 1 -1.173832 -0.934796
   2 -1.100040 -0.027994
   3 -0.640622  0.424231

In [67]:
fd.loc['G2']

          $         @         #         *
1  0.820138  1.279440 -2.007495 -0.725142
2 -1.169742  0.814842 -1.159823 -1.601048
3  0.149229  1.884882  1.031405 -1.787932

In [69]:
fd

             $         @         #         *
G1 1 -1.083450 -0.620927  0.295631 -0.125035
   2  0.482244  0.845536  1.147897  0.299140
   3  1.098071  0.053107 -0.830484  0.574053
G2 1  0.820138  1.279440 -2.007495 -0.725142
   2 -1.169742  0.814842 -1.159823 -1.601048
   3  0.149229  1.884882  1.031405 -1.787932

In [81]:
fd.index.names=['no','value']

In [83]:
fd

                 $         @         #         *
no value
G1 1     -1.083450 -0.620927  0.295631 -0.125035
   2      0.482244  0.845536  1.147897  0.299140
   3      1.098071  0.053107 -0.830484  0.574053
G2 1      0.820138  1.279440 -2.007495 -0.725142
   2     -1.169742  0.814842 -1.159823 -1.601048
   3      0.149229  1.884882  1.031405 -1.787932

In [85]:
fd.xs('G2')

              $         @         #         *
value
1      0.820138  1.279440 -2.007495 -0.725142
2     -1.169742  0.814842 -1.159823 -1.601048
3      0.149229  1.884882  1.031405 -1.787932

In [91]:
fd.xs(('G2',1))

$    0.820138
@    1.279440
#   -2.007495
*   -0.725142
Name: (G2, 1), dtype: float64

In [95]:
fd.xs((1,level='value'))

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (3732392981.py, line 1)